app/views/articles/show.html.erb

<h2>Comments</h2>
<% @article.comments.each do |comment| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 6