app/views/users/show.html.erb


  <% @user.articles.each do |article| %>
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`user_id` = 4