app/controllers/articles_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
def new

	@user = User.find(params[:user_id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 3 LIMIT 1
---
def show
  if params[:user_id] == nil
    @user = @current_user
  else
      @user = User.find(params[:user_id])
  end
      @article = Article.find(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
INSERT INTO `articles` (`title`, `author`, `text`, `user_id`, `created_at`, `updated_at`) VALUES ('New One ', 'sume', 'ssss', 4, '2016-04-06 09:52:11', '2016-04-06 09:52:11')
---
def create
  @user = User.find(params[:user_id])
  @article = @user.articles.create(article_params)