app/controllers/comments_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 6 LIMIT 1
INSERT INTO `comments` (`commenting`, `body`, `article_id`, `user_id`, `created_at`, `updated_at`) VALUES ('error', 'error', 2, 1, '2016-04-07 17:15:37', '2016-04-07 17:15:37')
---
def create
	if params[:user_id]
	@user = User.find(params[:user_id]).id
    else
    	@user = session[:user_id]
    end

	@article = Article.find(params[:article_id])
	@comment = @article.comments.build(comment_params)
	@comment.user_id = @user
    @comment.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 6 LIMIT 1
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1
---
def destroy
	@user = User.find(params[:user_id])
	@article = Article.find(params[:article_id])
	@comment = Comment.find(params[:id])
    @comment.destroy