app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('s', 'sumedbagde1412@gmail.com', '$2a$10$PQeNNpPfhen0Z05R8AsXK.L3EWwaw8jahA9NUe/ZKr7SoBBByg/0q', '2016-04-05 20:39:58', '2016-04-05 20:39:58')
---
def create
   @user = User.new(user_params)

if @user.save